programming/go/go_old.html
---
title: "Go"
---
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-02-17 Sun 22:43 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Go</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Victor Chen" />
<meta name="viewport" content="width=device-width, initial-scale=1">
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/font.css"/>
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/htmlize.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Go</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc8c870c">1 函数</a>
<ul>
<li><a href="#org4ad40b7">1.1 函数作参数</a></li>
<li><a href="#org4e6292a">1.2 函数作返回值</a></li>
</ul>
</li>
<li><a href="#org12b5976">2 方法</a>
<ul>
<li><a href="#org387b696">2.1 接口</a>
<ul>
<li><a href="#org9b16a0a">2.1.1 示例</a></li>
<li><a href="#orgae97156">2.1.2 <code>nil</code></a></li>
<li><a href="#org45d14fd">2.1.3 空接口</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgc8c870c" class="outline-2">
<h2 id="orgc8c870c"><span class="section-number-2">1</span> 函数</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-org4ad40b7" class="outline-3">
<h3 id="org4ad40b7"><span class="section-number-3">1.1</span> 函数作参数</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>示例</label><pre class="src src-go"><span class="org-keyword">func</span> <span class="org-function-name">compute</span>(fn <span class="org-keyword">func</span>(<span class="org-type">int</span>, <span class="org-type">int</span>) <span class="org-type">int</span>) <span class="org-type">int</span> {
    <span class="org-keyword">return</span> <span class="org-function-name">fn</span>(3, 4)
}

<span class="org-keyword">func</span> <span class="org-function-name">main</span>() {
    hypot := <span class="org-keyword">func</span>(x, y <span class="org-type">int</span>) <span class="org-type">int</span> {
        <span class="org-keyword">return</span> math.<span class="org-function-name">Sqrt</span>(x * x + y * y)
    }
    fmt.<span class="org-function-name">Println</span>(<span class="org-function-name">compute</span>(hypot))    <span class="org-comment-delimiter">// </span><span class="org-comment">5</span>
    fmt.<span class="org-function-name">Println</span>(<span class="org-function-name">compute</span>(math.Pow)) <span class="org-comment-delimiter">// </span><span class="org-comment">81</span>
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org4e6292a" class="outline-3">
<h3 id="org4e6292a"><span class="section-number-3">1.2</span> 函数作返回值</h3>
<div class="outline-text-3" id="text-1-2">
<p>
匿名函数，形成闭包。
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 2: </span>示例</label><pre class="src src-go"><span class="org-keyword">func</span> <span class="org-function-name">seq</span>() <span class="org-keyword">func</span>() <span class="org-type">int</span> {
    i := 0
    <span class="org-keyword">return</span> <span class="org-keyword">func</span>() <span class="org-type">int</span> {
        i += 1
        <span class="org-keyword">return</span> i
    }
}

next := <span class="org-function-name">seq</span>()
a := <span class="org-function-name">next</span>() <span class="org-comment-delimiter">// </span><span class="org-comment">1</span>
b := <span class="org-function-name">next</span>() <span class="org-comment-delimiter">// </span><span class="org-comment">2</span>

<span class="org-comment-delimiter">// </span><span class="org-comment">&#27599;&#20010;&#38381;&#21253;&#32500;&#25252;&#21508;&#33258;&#30340;&#21464;&#37327;&#20540;</span>
next2 := <span class="org-function-name">seq</span>()
c := <span class="org-function-name">next2</span>() <span class="org-comment-delimiter">// </span><span class="org-comment">1</span>
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 3: </span>示例</label><pre class="src src-go"><span class="org-keyword">func</span> <span class="org-function-name">adder</span>() <span class="org-keyword">func</span>(<span class="org-type">int</span>) <span class="org-type">int</span> {
    sum := 0
    <span class="org-keyword">return</span> <span class="org-keyword">func</span>(x <span class="org-type">int</span>) <span class="org-type">int</span> {
        sum += x
        <span class="org-keyword">return</span> sum
    }
}

<span class="org-keyword">func</span> <span class="org-function-name">main</span>() {
    pos, neg := <span class="org-function-name">adder</span>(), <span class="org-function-name">adder</span>()
    <span class="org-keyword">for</span> i := 0; i &lt; 10; i++ {
        fmt.<span class="org-function-name">Println</span>(<span class="org-function-name">pos</span>(i), <span class="org-function-name">neg</span>(-i))
    }
}

<span class="org-comment-delimiter">// </span><span class="org-comment">0 0</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">1 -1</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">3 -3</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">...</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org12b5976" class="outline-2">
<h2 id="org12b5976"><span class="section-number-2">2</span> 方法</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-org387b696" class="outline-3">
<h3 id="org387b696"><span class="section-number-3">2.1</span> 接口</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>接口是一组方法的签名。</li>
<li>接口中声明的方法签名必须被用于不同 receiver 的方法实现。</li>
</ul>

<div class="org-src-container">
<pre class="src src-go"><span class="org-keyword">type</span> <span class="org-type">&lt;name&gt;</span> <span class="org-keyword">interface</span> {
    &lt;method&gt;() &lt;<span class="org-keyword">type</span>&gt;
    ...
}
</pre>
</div>
</div>

<div id="outline-container-org9b16a0a" class="outline-4">
<h4 id="org9b16a0a"><span class="section-number-4">2.1.1</span> 示例</h4>
<div class="outline-text-4" id="text-2-1-1">
<div class="org-src-container">
<pre class="src src-go"><span class="org-keyword">type</span> <span class="org-type">Abser</span> <span class="org-keyword">interface</span> { <span class="org-comment-delimiter">// </span><span class="org-comment">&#25509;&#21475;</span>
    <span class="org-function-name">Abs</span>() float64      <span class="org-comment-delimiter">// </span><span class="org-comment">&#26041;&#27861;&#31614;&#21517;</span>
}

<span class="org-keyword">type</span> <span class="org-type">MyFloat1</span> <span class="org-type">float64</span>
<span class="org-keyword">type</span> <span class="org-type">MyFloat2</span> <span class="org-type">float64</span> <span class="org-comment-delimiter">// </span><span class="org-comment">&#26410;&#23454;&#29616; Abser &#25509;&#21475;</span>
<span class="org-keyword">type</span> <span class="org-type">Vertex</span> <span class="org-keyword">struct</span> {
    X, Y float64
}

<span class="org-keyword">func</span> (f <span class="org-type">MyFloat1</span>) <span class="org-function-name">Abs</span>() <span class="org-type">float64</span> {
    <span class="org-keyword">if</span> f &lt; 0 {
        <span class="org-keyword">return</span> <span class="org-function-name">float64</span>(-f)
    } <span class="org-keyword">else</span> {
        <span class="org-keyword">return</span> <span class="org-function-name">float64</span>(f)
    }
}

<span class="org-keyword">func</span> (v *<span class="org-type">Vertex</span>) <span class="org-function-name">Abs</span>() <span class="org-type">float64</span> {
    <span class="org-keyword">return</span> math.<span class="org-function-name">Sqrt</span>(v.X*v.X + v.Y*v.Y)
}

<span class="org-keyword">func</span> <span class="org-function-name">main</span>() {
    <span class="org-keyword">var</span> a Abser

    a = <span class="org-function-name">MyFloat1</span>(-math.Sqrt2)
    fmt.<span class="org-function-name">Println</span>(a.<span class="org-function-name">Abs</span>()) <span class="org-comment-delimiter">// </span><span class="org-comment">1.41421...</span>

    a = <span class="org-function-name">MyFloat2</span>(-math.Sqrt2)
    fmt.<span class="org-function-name">Println</span>(a.<span class="org-function-name">Abs</span>()) <span class="org-comment-delimiter">// </span><span class="org-comment">Error: MyFloat2 &#27809;&#26377;&#23454;&#29616; Abs &#26041;&#27861;</span>

    a = &amp;<span class="org-type">Vertex</span>{3, 4}
    fmt.<span class="org-function-name">Println</span>(a.<span class="org-function-name">Abs</span>()) <span class="org-comment-delimiter">// </span><span class="org-comment">5</span>
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgae97156" class="outline-4">
<h4 id="orgae97156"><span class="section-number-4">2.1.2</span> <code>nil</code></h4>
<div class="outline-text-4" id="text-2-1-2">
<div class="org-src-container">
<pre class="src src-go"><span class="org-keyword">type</span> <span class="org-type">Foo</span> <span class="org-keyword">interface</span> {
    <span class="org-function-name">Method</span>()
}

<span class="org-keyword">type</span> <span class="org-type">Bar</span> <span class="org-keyword">struct</span> {
    Str string
}

<span class="org-keyword">func</span> (t *<span class="org-type">Bar</span>) <span class="org-function-name">Method</span>() {
    <span class="org-keyword">if</span> t == <span class="org-constant">nil</span> {
        fmt.<span class="org-function-name">Println</span>(<span class="org-string">"&lt;nil&gt;"</span>)
    } <span class="org-keyword">else</span> {
        fmt.<span class="org-function-name">Println</span>(t.Str)
    }
}

<span class="org-keyword">func</span> <span class="org-function-name">main</span>() {
    <span class="org-keyword">var</span> a Foo  <span class="org-comment-delimiter">// </span><span class="org-comment">value = &lt;nil&gt;, type = &lt;nil&gt;</span>
    a.<span class="org-function-name">Method</span>() <span class="org-comment-delimiter">// </span><span class="org-comment">Runtime error: nil pointer</span>
               <span class="org-comment-delimiter">// </span><span class="org-comment">&#25509;&#21475;&#20540;&#21644;&#31867;&#22411;&#37117;&#20026; nil&#65292;&#26080;&#27861;&#24471;&#30693;&#24212;&#35813;&#35843;&#29992;&#30340;&#26041;&#27861;</span>

    <span class="org-keyword">var</span> b *Bar
    a = b      <span class="org-comment-delimiter">// </span><span class="org-comment">value = &lt;nil&gt;, type = *main.Bar</span>
    a.<span class="org-function-name">Method</span>() <span class="org-comment-delimiter">// </span><span class="org-comment">&lt;nil&gt; </span>
               <span class="org-comment-delimiter">// </span><span class="org-comment">&#25509;&#21475;&#20540;&#20026; nil&#65292;&#31867;&#22411;&#19981;&#20026; nil</span>

    <span class="org-keyword">var</span> c *Bar
    c = &amp;<span class="org-type">Bar</span>{<span class="org-string">"Hello"</span>}
    a = c      <span class="org-comment-delimiter">// </span><span class="org-comment">value = &amp;{Hello}, type = *main.Bar</span>
    a.<span class="org-function-name">Method</span>() <span class="org-comment-delimiter">// </span><span class="org-comment">Hello</span>
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org45d14fd" class="outline-4">
<h4 id="org45d14fd"><span class="section-number-4">2.1.3</span> 空接口</h4>
<div class="outline-text-4" id="text-2-1-3">
<p>
未定义方法的空接口
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Victor Chen</p>
<p class="date">Created: 2019-02-17 Sun 22:43</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
